---
type: InsulationType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 3
tags: [revit-api, class]
---

# InsulationType

`Autodesk.Revit.DB.Electrical.InsulationType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsInUse | — | `public bool IsInUse { get ; }` |
| Property | Name | — | `public override string Name { set ; }` |
| Property | Parameter | — | `` |